RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f20x_eth.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32f20x_eth.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2021/08/08
* Description        : This file contains all the functions prototypes for the
*                      ETH firmware library.
*******************************************************************************/
#ifndef __CH32F20x_ETH_H
#define __CH32F20x_ETH_H

#include "ch32f20x.h"


#define PHY_10BASE_T_LINKED   1
#define PHY_10BASE_T_NOT_LINKED   0

#define DMA_TPS_Mask      ((uint32_t)0x00700000) 	
#define DMA_RPS_Mask      ((uint32_t)0x000E0000) 	

/* ETH Init structure definition */
typedef struct {
    uint32_t             ETH_AutoNegotiation;           /* Selects or not the AutoNegotiation mode for the external PHY
                                                           The AutoNegotiation allows an automatic setting of the Speed (10/100Mbps)
                                                           and the mode (half/full-duplex).
                                                           This parameter can be a value of @ref ETH_AutoNegotiation */

    uint32_t             ETH_Watchdog;                  /* Selects or not the Watchdog timer
                                                           When enabled, the MAC allows no more then 2048 bytes to be received.
                                                           When disabled, the MAC can receive up to 16384 bytes.
                                                           This parameter can be a value of @ref ETH_watchdog */  

    uint32_t             ETH_Jabber;                    /* Selects or not Jabber timer
                                                           When enabled, the MAC allows no more then 2048 bytes to be sent.
                                                           When disabled, the MAC can send up to 16384 bytes.
                                                           This parameter can be a value of @ref ETH_Jabber */

    uint32_t             ETH_InterFrameGap;             /* Selects the minimum IFG between frames during transmission
                                                           This parameter can be a value of @ref ETH_Inter_Frame_Gap */   

    uint32_t             ETH_CarrierSense;              /* Selects or not the Carrier Sense
                                                           This parameter can be a value of @ref ETH_Carrier_Sense */

    uint32_t             ETH_Speed;                     /* Sets the Ethernet speed: 10/100 Mbps
                                                           This parameter can be a value of @ref ETH_Speed */

    uint32_t             ETH_ReceiveOwn;                /* Selects or not the ReceiveOwn
                                                           ReceiveOwn allows the reception of frames when the TX_EN signal is asserted
                                                           in Half-Duplex mode
                                                           This parameter can be a value of @ref ETH_Receive_Own */  

    uint32_t             ETH_LoopbackMode;              /* Selects or not the internal MAC MII Loopback mode
                                                           This parameter can be a value of @ref ETH_Loop_Back_Mode */  

    uint32_t             ETH_Mode;                      /* Selects the MAC duplex mode: Half-Duplex or Full-Duplex mode
                                                           This parameter can be a value of @ref ETH_Duplex_Mode */  

    uint32_t             ETH_ChecksumOffload;           /* Selects or not the IPv4 checksum checking for received frame payloads' TCP/UDP/ICMP headers.
                                                           This parameter can be a value of @ref ETH_Checksum_Offload */    

    uint32_t             ETH_RetryTransmission;         /* Selects or not the MAC attempt retries transmission, based on the settings of BL,
                                                           when a colision occurs (Half-Duplex mode)
                                                           This parameter can be a value of @ref ETH_Retry_Transmission */

    uint32_t             ETH_AutomaticPadCRCStrip;      /* Selects or not the Automatic MAC Pad/CRC Stripping
                                                           This parameter can be a value of @ref ETH_Automatic_Pad_CRC_Strip */ 

    uint32_t             ETH_BackOffLimit;              /* Selects the BackOff limit value
                                                           This parameter can be a value of @ref ETH_Back_Off_Limit */

    uint32_t             ETH_DeferralCheck;             /* Selects or not the deferral check function (Half-Duplex mode)
                                                           This parameter can be a value of @ref ETH_Deferral_Check */                                                                                                        

    uint32_t             ETH_ReceiveAll;                /* Selects or not all frames reception by the MAC (No fitering)
                                                           This parameter can be a value of @ref ETH_Receive_All */   

    uint32_t             ETH_SourceAddrFilter;          /* Selects the Source Address Filter mode
                                                           This parameter can be a value of @ref ETH_Source_Addr_Filter */                  

    uint32_t             ETH_PassControlFrames;         /* Sets the forwarding mode of the control frames (including unicast and multicast PAUSE frames)
                                                           This parameter can be a value of @ref ETH_Pass_Control_Frames */ 

    uint32_t             ETH_BroadcastFramesReception;  /* Selects or not the reception of Broadcast Frames
                                                           This parameter can be a value of @ref ETH_Broadcast_Frames_Reception */

    uint32_t             ETH_DestinationAddrFilter;     /* Sets the destination filter mode for both unicast and multicast frames
                                                           This parameter can be a value of @ref ETH_Destination_Addr_Filter */ 

    uint32_t             ETH_PromiscuousMode;           /* Selects or not the Promiscuous Mode
                                                           This parameter can be a value of @ref ETH_Promiscuous_Mode */

    uint32_t             ETH_MulticastFramesFilter;     /* Selects the Multicast Frames filter mode: None/HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                                           This parameter can be a value of @ref ETH_Multicast_Frames_Filter */ 

    uint32_t             ETH_UnicastFramesFilter;       /* Selects the Unicast Frames filter mode: HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                                           This parameter can be a value of @ref ETH_Unicast_Frames_Filter */ 

    uint32_t             ETH_HashTableHigh;             /* This field holds the higher 32 bits of Hash table.  */

    uint32_t             ETH_HashTableLow;              /* This field holds the lower 32 bits of Hash table.  */

